apps/latency-benchmarks/artillery.yaml
config:
  target: https://latency-benchmarks.unkey.workers.dev
  phases:
    - name: Ramp up
      duration: 1m
      arrivalRate: 1
      rampTo: 10
    - name: Sustain
      duration: 1m
      arrivalRate: 10
 
 

scenarios:
  - flow:
    - post:
        url: "/"
        method: "POST"
        json:
          - name: "aws-ga"
            url: "https://g.unkey.org/v1/liveness"
          - name: "aws-route53"
            url: "https://r.unkey.org/v1/liveness"
          - name: "aws-us-east-1"
            url: "https://liveness-q91w02nj.fctl.app/v1/liveness"
          - name: "koyeb-global"
            url: "https://rich-mela-unkey-95820a9c.koyeb.app/v1/liveness"
          - name: "koyeb-us-east-1"
            url: "https://grubby-christabella-unkey-4e61f00b.koyeb.app/v1/liveness"
        expect:
          - statusCode: 200